Revit 2027 API
ParameterTypeId.SheetGuideGrid Property
 "Guide Grid"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SheetGuideGrid { get; }
Public Shared ReadOnly Property SheetGuideGrid As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SheetGuideGrid {
	ForgeTypeId^ get ();
}
static member SheetGuideGrid : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace